# Lab 3

Author: Ryan Rosiak [rrosiak1@gulls.salisbury.edu]

Date: 9/17/20

Description: Working with the adult dataset and starting some real data visualization

In [23]:
import pandas as pd # Pandas library
import numpy as np # Numpy library
import matplotlib.pyplot as plt # Matplotlib library for plotting

In [24]:
# Parse the file
adult_data = pd.read_csv('./adult.data',
                      header=None,
                      skipinitialspace=True,
                      names=['age', 'workclass', 'fnlwgt', 'education',
                             'education-num', 'marital-status', 
                             'occupation', 'relationship', 'race',
                             'sex', 'capital_gain', 'capital_loss',
                             'hr_per_week', 'country', 'income'
                            ]
                     )
adult_data.head() # Printing the first couple sets of data

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital_gain,capital_loss,hr_per_week,country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [25]:
adult_data[['occupation', 'income']].head() # Printing the data of occupation and income

          occupation income
0       Adm-clerical  <=50K
1    Exec-managerial  <=50K
2  Handlers-cleaners  <=50K
3  Handlers-cleaners  <=50K
4     Prof-specialty  <=50K

In [41]:
# 3.a Rank the data in terms of most likely to make the most money
# Select what columns I want first
tmp = adult_data[['occupation', 'income']]
# Sort the data by occupations that make more than 50k and then group by their occupation and count the amount, sort their incomes in descending order
tmp[tmp['income'] == ">50K"].groupby(by='occupation').count().sort_values(by='income', ascending=False)

                   income
occupation
Exec-managerial      1968
Prof-specialty       1859
Sales                 983
Craft-repair          929
Adm-clerical          507
Transport-moving      320
Tech-support          283
Machine-op-inspct     250
Protective-serv       211
?                     191
Other-service         137
Farming-fishing       115
Handlers-cleaners      86
Armed-Forces            1
Priv-house-serv         1

In [ ]:
# 3.b
# The median for